app/views/carts/_shopping_cart.html.erb

SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---

<% if current_order.order_items.size == 0 %>