app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["product_id", 1], ["order_id", 1], ["unit_price", "0.49"], ["quantity", 1], ["total_price", "0.49"], ["created_at", "2019-06-21 17:31:32.152674"], ["updated_at", "2019-06-21 17:31:32.152674"]]
INSERT INTO "user_orders" ("user_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["order_id", 1], ["created_at", "2019-06-21 20:52:05.244664"], ["updated_at", "2019-06-21 20:52:05.244664"]]
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    if @order.save

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 4], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 5], ["total_price", 2.45], ["updated_at", "2019-06-09 10:22:18.988453"], ["id", 4]]
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 1]]
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy