app/views/layouts/_cart_text.html.erb

<%= link_to "#{current_order.order_items.size} Items in Cart ( #{number_to_currency current_order.subtotal} )", root_path, class: "btn btn-link" %>
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]